{"pages":[],"posts":[{"title":"Virtualization monitoring process","slug":"new 4","date":"2017-09-17T09:03:02.957Z","updated":"2017-09-17T09:03:02.960Z","comments":true,"path":"2017/09/17/new 4/","link":"","permalink":"http://yoursite.com/2017/09/17/new 4/","excerpt":"","text":"With the popularity of cloud computing, virtual machine introspection techniques and tools are increasingly being used to monitor the behavior of virtual machines in the IaaS cloud. With the help of these technologies, many applications can be installed outside the virtual machine, but also can provide services for the virtual machine, such as security monitoring software, virus detection software. But the technology must overcome a problem, the semantic gap: the management program can see the city state and their virtual machine within the expression of the semantic separation. This article focuses on the use of introspection technology to monitor the kernel process and the days of stepping on the various pit. Introduction Docinstall xen on the ubuntu1sudo apt-get install virt-manager Site of docu: sites The virtual machine is created to run1$ There is no need for instructions here, as to download ubuntu system More info: Ubantu libvim variant installation12345678910sudo apt-get install libglib2.0-devsudo apt-get install check./autogen.sh./configuremakeThe way of init libvim:su -make installldconfigexit More info: As each person’s computer situation is different, the installation process has different problems, welcome to ask, I will solve for everyone!More info: libvim Deploy to remote sites1Formula: * p = p-pid; More info: According to the various versions of the operating system data structure Xie wrote the main function of the module and Makfile fileFormula: * p = p-pid;Also perform a file to view the kernel data structure of the various defined macros as well as the operationMore info: site","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2017-09-13T06:04:39.929Z","updated":"2017-09-13T06:04:39.929Z","comments":true,"path":"2017/09/13/hello-world/","link":"","permalink":"http://yoursite.com/2017/09/13/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}